Tekla Open API Reference for Tekla Structures 2025
PickerInputObjectAndAPoint Constructor
 Creates a new PickerInputObjectAndAPoint instance representing the pick of a drawing object and the coordinates of the point used to pick the object.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PickerInputObjectAndAPoint(
	DrawingObject pickedObject,
	Point pickedPoint
)
Public Sub New (
	pickedObject As DrawingObject,
	pickedPoint As Point
)
Parameters
pickedObject
Type: Tekla.Structures.Drawing.DrawingObject
The picked drawing object.
pickedPoint
Type: Tekla.Structures.Geometry3d.Point
The picked point in the picked object view coordinates.
See Also
Reference
PickerInputObjectAndAPoint Class
Tekla.Structures.Drawing Namespace